{
  "_name_or_path": "BAAI/bge-reranker-v2-minicpm-layerwise",
  "architectures": [
    "LayerWiseMiniCPMForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "BAAI/bge-reranker-v2-minicpm-layerwise--configuration_minicpm_reranker.LayerWiseMiniCPMConfig",
    "AutoModel": "BAAI/bge-reranker-v2-minicpm-layerwise--modeling_minicpm_reranker.LayerWiseMiniCPMModel",
    "AutoModelForCausalLM": "BAAI/bge-reranker-v2-minicpm-layerwise--modeling_minicpm_reranker.LayerWiseMiniCPMForCausalLM"
  },
  "bos_token_id": 1,
  "dim_model_base": 64,
  "eos_token_id": 2,
  "head_multi": true,
  "head_type": "simple",
  "hidden_act": "silu",
  "hidden_size": 128,
  "initializer_range": 0.1,
  "intermediate_size": 256,
  "max_position_embeddings": 256,
  "model_type": "minicpm",
  "num_attention_heads": 2,
  "num_hidden_layers": 2,
  "num_key_value_heads": 2,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "scale_depth": 1.4,
  "scale_emb": 12,
  "start_layer": 0,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.38.1",
  "use_cache": false,
  "vocab_size": 1000
}