{
    "architectures": [
      "OpenAIGPTLMHeadModel"
    ],  
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": 128,
    "initializer_range": 0.02,
    "intermediate_size": 1376,
    "max_position_embeddings": 1024,
    "model_type": "openai-gpt",
    "num_attention_heads": 2, 
    "num_hidden_layers": 2, 
    "num_key_value_heads": 2, 
    "pad_token_id": 0,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.31.0",
    "use_cache": true,
    "vocab_size": 300
  }
  
  
  
  