{
    "_name_or_path": "/group/40077/users/clearli/weights/internlm-xcomposer2d5-7b",
    "architectures": [
        "InternLMXComposr2ForCausalLM"
    ],
    "attn_implementation": "flash_attention_2",
    "auto_map": {
        "AutoConfig": "configuration_internlm_xcomposer2.InternLMXcomposer2Config",
        "AutoModel": "modeling_internlm_xcomposer2.InternLMXComposer2ForCausalLM",
        "AutoModelForCausalLM": "modeling_internlm_xcomposer2.InternLMXComposer2ForCausalLM"
    },
    "bias": false,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": 128,
    "initializer_range": 0.02,
    "intermediate_size": 1376,
    "max_position_embeddings": 1024,
    "model_type": "internlm2",
    "num_attention_heads": 2,
    "num_hidden_layers": 2,
    "num_key_value_heads": 2,
    "pad_token_id": 2,
    "rms_norm_eps": 0.00001,
    "rope_scaling": {
        "factor": 2,
        "type": "dynamic"
    },
    "rope_theta": 1000000,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.36.2",
    "use_cache": false,
    "vocab_size": 300
}